

//**--------------头文件-------------------------------------------------------
#include <xc.h>
#include <GenericTypeDefs.h>

#include "userdefine.h"

//**--------------全局变量-----------------------------------------------------

//**--------------宏定义-------------------------------------------------------

//**--------------函数申明-----------------------------------------------------

//**--------------函数定义-----------------------------------------------------


/**********************************************************************
*函数名称：init_timer1
*描述：TIME1初始化 系统时基 定时1ms
*返回类型：void
*输入形参：void
***********************************************************************/
void init_timer1(void) 
{
	TMR1H = 0xE0; // 16 位 TMR1 寄存器高字节的保持寄存器
	TMR1L = 0xC0; // 16 位 TMR1 寄存器低字节的保持寄存器 定时1ms
	T1CON = 0x60; // bit7-6 01 Timer1时钟源为系统时钟 
	              // bit0 0 禁止使能 Timer1
	              // bit5-4 10 Timer1 输入时钟预分频比选择位 1:4
	               
	T1GCONbits.TMR1GE=0;
	              
	TMR1IE = 0x01; // 使能定时器1中断
	TMR1ON =0;
}
